johann-CH/ESP32_Sofar_KTLX-G3_Modbus_MQTT_HA_Integration/ESP32_Sofar_KTLX-G3_Modbus_MQTT/ESP32_Sofar_KTLX-G3_Modbus_MQTT.h
/*
  ESP32_Sofar_KTLX-G3_Modbus_MQTT.h
*/

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
// modbus error code indexes
#define MODBUS_ERROR_CODE_0XE0_INDEX 0
#define MODBUS_ERROR_CODE_0XE1_INDEX 1
#define MODBUS_ERROR_CODE_0XE2_INDEX 2
#define MODBUS_ERROR_CODE_0XE3_INDEX 3

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
// pv inverter Sofar KTLX-G3 register blocks
#define INVERTER_REGISTER_BLOCK_SYSINFO1_SYSTIME          -
#define INVERTER_REGISTER_BLOCK_SYSINFO1                  0
#define INVERTER_REGISTER_BLOCK_SYSINFO2                  1
#define INVERTER_REGISTER_BLOCK_GRIDOUTPUT1               2
#define INVERTER_REGISTER_BLOCK_EMERGENCYOUTPUT1          3
#define INVERTER_REGISTER_BLOCK_INPUTPV1                  4
#define INVERTER_REGISTER_BLOCK_INPUTPV2                  5
#define INVERTER_REGISTER_BLOCK_INPUTBAT1                 6
#define INVERTER_REGISTER_BLOCK_INPUTBAT2                 7
#define INVERTER_REGISTER_BLOCK_STATISTICS                8
#define INVERTER_REGISTER_BLOCK_UNBALANCEDSUPPORT_CONTROL 9
#define INVERTER_REGISTER_BLOCK_GENERAL1                  10

// pv inverter Sofar KTLX-G3 SysInfo1 [0x042C-0x0431 / 1068-1073] / register block SysTime
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_HEAD     0x0400
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_TAIL     0x043B
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_SIZE     (INVERTER_REGISTER_SYSINFO1_SYSTIME_TAIL - INVERTER_REGISTER_SYSINFO1_SYSTIME_HEAD + 1)
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_ELEMENTS 8
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_ACTIVE   1
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_YEAR     0x042C
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_MONTH    0x042D
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_DAY      0x042E
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_HOUR     0x042F
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_MINUTE   0x0430
#define INVERTER_REGISTER_SYSINFO1_SYSTIME_SECOND   0x0431

// pv inverter Sofar KTLX-G3 SysInfo1 [0x0400-0x043B / 1024-1082] / register block #0
#define INVERTER_REGISTER_SYSINFO1_HEAD                 0x0400
#define INVERTER_REGISTER_SYSINFO1_TAIL                 0x043B
#define INVERTER_REGISTER_SYSINFO1_SIZE                 (INVERTER_REGISTER_SYSINFO1_TAIL - INVERTER_REGISTER_SYSINFO1_HEAD + 1)
#define INVERTER_REGISTER_SYSINFO1_ELEMENTS             27
#define INVERTER_REGISTER_SYSINFO1_ACTIVE               1
#define INVERTER_REGISTER_SYSINFO1_SYSSTATE             0x0404
#define INVERTER_REGISTER_SYSINFO1_FAULT01              0x0405
#define INVERTER_REGISTER_SYSINFO1_FAULT02              0x0406
#define INVERTER_REGISTER_SYSINFO1_FAULT03              0x0407
#define INVERTER_REGISTER_SYSINFO1_FAULT04              0x0408
#define INVERTER_REGISTER_SYSINFO1_FAULT05              0x0409
#define INVERTER_REGISTER_SYSINFO1_FAULT06              0x040A
#define INVERTER_REGISTER_SYSINFO1_FAULT07              0x040B
#define INVERTER_REGISTER_SYSINFO1_FAULT08              0x040C
#define INVERTER_REGISTER_SYSINFO1_FAULT09              0x040D
#define INVERTER_REGISTER_SYSINFO1_FAULT10              0x040E
#define INVERTER_REGISTER_SYSINFO1_FAULT11              0x040F
#define INVERTER_REGISTER_SYSINFO1_FAULT12              0x0410
#define INVERTER_REGISTER_SYSINFO1_FAULT13              0x0411
#define INVERTER_REGISTER_SYSINFO1_FAULT14              0x0412
#define INVERTER_REGISTER_SYSINFO1_FAULT15              0x0413
#define INVERTER_REGISTER_SYSINFO1_FAULT16              0x0414
#define INVERTER_REGISTER_SYSINFO1_FAULT17              0x0415
#define INVERTER_REGISTER_SYSINFO1_FAULT18              0x0416
//#define INVERTER_REGISTER_SYSINFO1_COUNTDOWN            0x0417
#define INVERTER_REGISTER_SYSINFO1_TEMP_ENV1            0x0418
// Temperature_Env2 F16 1.0
#define INVERTER_REGISTER_SYSINFO1_TEMP_HEATSINK1       0x041A
// ...
// Temperature_HeatSink6 F16 1.0
#define INVERTER_REGISTER_SYSINFO1_TEMP_INV1            0x0420
// ...
// Temperature_Inv3 F16 1.0
// Temp_Rsvd1 F16 1.0
// ...
// Temp_Rsvd3 F16 1.0
#define INVERTER_REGISTER_SYSINFO1_GENERATION_TIME_TODAY 0x0426
#define INVERTER_REGISTER_SYSINFO1_GENERATION_TIME_TOTAL 0x0427
#define INVERTER_REGISTER_SYSINFO1_SERVICETIME_TOTAL    0x0429
// ...
//#define INVERTER_REGISTER_SYSINFO1_SYSTIME_YEAR         0x042C
//#define INVERTER_REGISTER_SYSINFO1_SYSTIME_MONTH        0x042D
//#define INVERTER_REGISTER_SYSINFO1_SYSTIME_DAY          0x042E
//#define INVERTER_REGISTER_SYSINFO1_SYSTIME_HOUR         0x042F
//#define INVERTER_REGISTER_SYSINFO1_SYSTIME_MINUTE       0x0430
//#define INVERTER_REGISTER_SYSINFO1_SYSTIME_SECOND       0x0431
// ...
// Fault19 U16
// ...
// Fault27 U16

// pv inverter Sofar KTLX-G3 SysInfo2 [0x0440-0x047F / 1088-1151] / register block #1
#define INVERTER_REGISTER_SYSINFO2_HEAD                           0x0440
#define INVERTER_REGISTER_SYSINFO2_TAIL                           0x047F
#define INVERTER_REGISTER_SYSINFO2_SIZE                           (INVERTER_REGISTER_SYSINFO2_TAIL - INVERTER_REGISTER_SYSINFO2_HEAD + 1)
#define INVERTER_REGISTER_SYSINFO2_ELEMENTS                       28
#define INVERTER_REGISTER_SYSINFO2_ACTIVE                         0
#define INVERTER_REGISTER_SYSINFO2_PRODUCTION_CODE                0x0444
// ...
#define INVERTER_REGISTER_SYSINFO2_HARDWARE_VERSION_0             0x044D
#define INVERTER_REGISTER_SYSINFO2_HARDWARE_VERSION_1             0x044E
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_STAGE_COM     0x044F
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MAJOR_COM     0x0450
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_CUSTOM_COM    0x0451
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MINOR_COM     0x0452
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_STAGE_MASTER  0x0453
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MAJOR_MASTER  0x0454
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_CUSTOM_MASTER 0x0455
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MINOR_MASTER  0x0456
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_STAGE_SLAVE   0x0457
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MAJOR_SLAVE   0x0458
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_CUSTOM_SLAVE  0x0459
#define INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MINOR_SLAVE   0x045A
#define INVERTER_REGISTER_SYSINFO2_SAFETY_VERSION_MAJOR           0x045B
#define INVERTER_REGISTER_SYSINFO2_SAFETY_VERSION_MINOR           0x045C
#define INVERTER_REGISTER_SYSINFO2_BOOT_VERSION_COM               0x045D
#define INVERTER_REGISTER_SYSINFO2_BOOT_VERSION_MASTER            0x045E
#define INVERTER_REGISTER_SYSINFO2_BOOT_VERSION_SLAVE             0x045F
#define INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_STAGE  0x0460
#define INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_MAJOR  0x0461
#define INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_CUSTOM 0x0462
#define INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_MINOR  0x0463
#define INVERTER_REGISTER_SYSINFO2_SAFETY_HARDWARE_VERSION0       0x0464
#define INVERTER_REGISTER_SYSINFO2_SAFETY_HARDWARE_VERSION1       0x0465
// ...
// State9 U16

// pv inverter Sofar KTLX-G3 GridOutput1 [0x0480-0x04BD / 1152-1213] / register block #2
#define INVERTER_REGISTER_GRIDOUTPUT1_HEAD               0x0480
#define INVERTER_REGISTER_GRIDOUTPUT1_TAIL               0x04BD
#define INVERTER_REGISTER_GRIDOUTPUT1_SIZE               (INVERTER_REGISTER_GRIDOUTPUT1_TAIL - INVERTER_REGISTER_GRIDOUTPUT1_HEAD + 1)
#define INVERTER_REGISTER_GRIDOUTPUT1_ELEMENTS           10
#define INVERTER_REGISTER_GRIDOUTPUT1_ACTIVE             1
#define INVERTER_REGISTER_GRIDOUTPUT1_FREQUENCY_GRID     0x0484
#define INVERTER_REGISTER_GRIDOUTPUT1_ACTIVE_POWER       0x0485
#define INVERTER_REGISTER_GRIDOUTPUT1_REACTIVE_POWER     0x0486
#define INVERTER_REGISTER_GRIDOUTPUT1_APPARENT_POWER     0x0487
#define INVERTER_REGISTER_GRIDOUTPUT1_ACTIVE_POWER_PCC   0x0488
#define INVERTER_REGISTER_GRIDOUTPUT1_REACTIVE_POWER_PCC 0x0489
#define INVERTER_REGISTER_GRIDOUTPUT1_APPARENT_POWER_PCC 0x048A
// ...
#define INVERTER_REGISTER_GRIDOUTPUT1_POWER_FACTOR       0x04BD

// pv inverter Sofar KTLX-G3 EmergenyOutput1 [0x0500-0x0527 / 1280-1319] / register block #3
#define INVERTER_REGISTER_EMERGENCYOUTPUT1_HEAD     0x0500
#define INVERTER_REGISTER_EMERGENCYOUTPUT1_TAIL     0x0527
#define INVERTER_REGISTER_EMERGENCYOUTPUT1_SIZE     (INVERTER_REGISTER_EMERGENCYOUTPUT1_TAIL - INVERTER_REGISTER_EMERGENCYOUTPUT1_HEAD + 1)
#define INVERTER_REGISTER_EMERGENCYOUTPUT1_ELEMENTS 2
#define INVERTER_REGISTER_EMERGENCYOUTPUT1_ACTIVE   0

// pv inverter Sofar KTLX-G3 InputPV1 [0x0580-0x05B3 / 1408-1459] / register block #4
#define INVERTER_REGISTER_INPUTPV1_HEAD        0x0580
#define INVERTER_REGISTER_INPUTPV1_TAIL        0x05B3
#define INVERTER_REGISTER_INPUTPV1_SIZE        (INVERTER_REGISTER_INPUTPV1_TAIL - INVERTER_REGISTER_INPUTPV1_HEAD + 1)
#define INVERTER_REGISTER_INPUTPV1_ELEMENTS    8
#define INVERTER_REGISTER_INPUTPV1_ACTIVE      1
#define INVERTER_REGISTER_INPUTPV1_VOLTAGE_PV1 0x0584
#define INVERTER_REGISTER_INPUTPV1_CURRENT_PV1 0x0585
#define INVERTER_REGISTER_INPUTPV1_POWER_PV1   0x0586
#define INVERTER_REGISTER_INPUTPV1_VOLTAGE_PV2 0x0587
#define INVERTER_REGISTER_INPUTPV1_CURRENT_PV2 0x0588
#define INVERTER_REGISTER_INPUTPV1_POWER_PV2   0x0589
// ...
// Voltage_PV16 U16 0.1
// Current_PV16 U16 0.01
// Power_PV16 U16 0.01

// pv inverter Sofar KTLX-G3 InputPV2 [0x05C0-0x05C4 / 1472-1476] / register block #5
#define INVERTER_REGISTER_INPUTPV2_HEAD           0x05C0
#define INVERTER_REGISTER_INPUTPV2_TAIL           0x05C4
#define INVERTER_REGISTER_INPUTPV2_SIZE           (INVERTER_REGISTER_INPUTPV2_TAIL - INVERTER_REGISTER_INPUTPV2_HEAD + 1)
#define INVERTER_REGISTER_INPUTPV2_ELEMENTS       3
#define INVERTER_REGISTER_INPUTPV2_ACTIVE         0
#define INVERTER_REGISTER_INPUTPV2_POWER_PV_TOTAL 0x05C4

// pv inverter Sofar KTLX-G3 InputBat1 [0x0600-0x063B / 1536-1595] / register block #6
#define INVERTER_REGISTER_INPUTBAT1_HEAD     0x0600
#define INVERTER_REGISTER_INPUTBAT1_TAIL     0x063B
#define INVERTER_REGISTER_INPUTBAT1_SIZE     (INVERTER_REGISTER_INPUTBAT1_TAIL - INVERTER_REGISTER_INPUTBAT1_HEAD + 1)
#define INVERTER_REGISTER_INPUTBAT1_ELEMENTS 2
#define INVERTER_REGISTER_INPUTBAT1_ACTIVE   0

// pv inverter Sofar KTLX-G3 InputBat2 [0x0640-0x0669 / 1600-1641] / register block #7
#define INVERTER_REGISTER_INPUTBAT2_HEAD     0x0640
#define INVERTER_REGISTER_INPUTBAT2_TAIL     0x0669
#define INVERTER_REGISTER_INPUTBAT2_SIZE     (INVERTER_REGISTER_INPUTBAT2_TAIL - INVERTER_REGISTER_INPUTBAT2_HEAD + 1)
#define INVERTER_REGISTER_INPUTBAT2_ELEMENTS 2
#define INVERTER_REGISTER_INPUTBAT2_ACTIVE   0

// pv inverter Sofar KTLX-G3 Realtime ElectricityStatistics1 [0x0680-0x069B / 1664-1691] / register block #8
#define INVERTER_REGISTER_STATISTICS_HEAD                   0x0680
#define INVERTER_REGISTER_STATISTICS_TAIL                   0x069B
#define INVERTER_REGISTER_STATISTICS_SIZE                   (INVERTER_REGISTER_STATISTICS_TAIL - INVERTER_REGISTER_STATISTICS_HEAD + 1)
#define INVERTER_REGISTER_STATISTICS_ELEMENTS               10
#define INVERTER_REGISTER_STATISTICS_ACTIVE                 1
#define INVERTER_REGISTER_STATISTICS_PV_GENERATION_TODAY    0x0684
#define INVERTER_REGISTER_STATISTICS_PV_GENERATION_TOTAL    0x0686
#define INVERTER_REGISTER_STATISTICS_LOAD_CONSUMPTION_TODAY 0x0688
#define INVERTER_REGISTER_STATISTICS_LOAD_CONSUMPTION_TOTAL 0x068A
#define INVERTER_REGISTER_STATISTICS_ENERGY_PURCHASE_TODAY  0x068C
#define INVERTER_REGISTER_STATISTICS_ENERGY_PURCHASE_TOTAL  0x068E
#define INVERTER_REGISTER_STATISTICS_ENERGY_SELLING_TODAY   0x0690
#define INVERTER_REGISTER_STATISTICS_ENERGY_SELLING_TOTAL   0x0692
//#define INVERTER_REGISTER_STATISTICS_BAT_CHARGE_TODAY       0x0694
//#define INVERTER_REGISTER_STATISTICS_BAT_CHARGE_TOTAL       0x0696
//#define INVERTER_REGISTER_STATISTICS_BAT_DISCHARGE_TODAY    0x0698
//#define INVERTER_REGISTER_STATISTICS_BAT_DISCHARGE_TOTAL    0x069A

// pv inverter Sofar KTLX-G3 UnblancedSupportControl [0x1038-0x103D / 4152-4157] / register block #9
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_HEAD                  0x1038
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_TAIL                  0x103D
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_SIZE                  (INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_TAIL - INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_HEAD + 1)
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ELEMENTS              7
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ACTIVE                0
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_PV_GENERATION_RATIO   0x1039
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ENERGY_PURCHASE_RATIO 0x103A
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ENERGY_SELLING_RATIO  0x103B
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_BAT_CHARGE_RATIO      0x103C
#define INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_BAT_DISCHARGE_RATIO   0x103D

#define INVERTER_REGISTER_BLOCK_COUNT 10  // number of inverter register blocks

