johann-CH/ESP32_Sofar_KTLX-G3_Modbus_MQTT_HA_Integration/ESP32_Sofar_KTLX-G3_Modbus_MQTT/ESP32_Sofar_KTLX-G3_Modbus_MQTT.h
#define INVERTER_REGISTER_SYSINFO1_SYSSTATE_INDEX 0x02

// pv inverter state code (INVERTER_REGISTER_SYSINFO1_SYSSTATE)
#define INVERTER_STATE_STANDBY           0x00
#define INVERTER_STATE_SELF_CHECK        0x01
#define INVERTER_STATE_NORMAL            0x02
#define INVERTER_STATE_BATTERY_ACTIVATED 0x03
#define INVERTER_STATE_FAULT             0x04
#define INVERTER_STATE_PERMANENT_FAULT   0x05
#define INVERTER_STATE_OFFLINE           0x06

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
#define SOFAR_MODBUS_CONVERTER_MQTT_SUBSCRIPTION_ELEMENTS 7
#define SOFAR_MODBUS_CONVERTER_MQTT_SUBSCRIPTION_ELEMENT_LENGTH 64

const char inverterModbusConverterMQTTSubscriptionsArray[SOFAR_MODBUS_CONVERTER_MQTT_SUBSCRIPTION_ELEMENTS][SOFAR_MODBUS_CONVERTER_MQTT_SUBSCRIPTION_ELEMENT_LENGTH] = {
  "Inverter_Modbus_Converter_Modbus_Errors_0xE0",
  "Inverter_Modbus_Converter_Modbus_Errors_0xE1",
  "Inverter_Modbus_Converter_Modbus_Errors_0xE2",
  "Inverter_Modbus_Converter_Modbus_Errors_0xE3",
  "Inverter_Modbus_Converter_MQTT_Keep_Alive",
  "Inverter_Modbus_Converter_MQTT_Keep_Alive_Received",
  "Inverter_Modbus_Converter_MQTT_Keep_Alive_Delayed"
};

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
struct inverterRegisterBlockStruct {
  uint16_t inverterRegisterBlockHead;
  uint16_t inverterRegisterBlockTail;
  uint16_t inverterRegisterBlockSize;
  uint16_t inverterRegisterBlockElements;
  uint16_t inverterRegisterBlockActive;
};

static struct inverterRegisterBlockStruct inverterRegisterBlockSysTime[] = {
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_HEAD, INVERTER_REGISTER_SYSINFO1_SYSTIME_TAIL, INVERTER_REGISTER_SYSINFO1_SYSTIME_SIZE, INVERTER_REGISTER_SYSINFO1_SYSTIME_ELEMENTS, INVERTER_REGISTER_SYSINFO1_SYSTIME_ACTIVE }  // #0
};

static struct inverterRegisterBlockStruct inverterRegisterBlocks[] = {
  { INVERTER_REGISTER_SYSINFO1_HEAD, INVERTER_REGISTER_SYSINFO1_TAIL, INVERTER_REGISTER_SYSINFO1_SIZE, INVERTER_REGISTER_SYSINFO1_ELEMENTS, INVERTER_REGISTER_SYSINFO1_ACTIVE },                                                                                      // #0
  { INVERTER_REGISTER_SYSINFO2_HEAD, INVERTER_REGISTER_SYSINFO2_TAIL, INVERTER_REGISTER_SYSINFO2_SIZE, INVERTER_REGISTER_SYSINFO2_ELEMENTS, INVERTER_REGISTER_SYSINFO2_ACTIVE },                                                                                      // #1
  { INVERTER_REGISTER_GRIDOUTPUT1_HEAD, INVERTER_REGISTER_GRIDOUTPUT1_TAIL, INVERTER_REGISTER_GRIDOUTPUT1_SIZE, INVERTER_REGISTER_GRIDOUTPUT1_ELEMENTS, INVERTER_REGISTER_GRIDOUTPUT1_ACTIVE },                                                                       // #2
  { INVERTER_REGISTER_EMERGENCYOUTPUT1_HEAD, INVERTER_REGISTER_EMERGENCYOUTPUT1_TAIL, INVERTER_REGISTER_EMERGENCYOUTPUT1_SIZE, INVERTER_REGISTER_EMERGENCYOUTPUT1_ELEMENTS, INVERTER_REGISTER_EMERGENCYOUTPUT1_ACTIVE },                                              // #3
  { INVERTER_REGISTER_INPUTPV1_HEAD, INVERTER_REGISTER_INPUTPV1_TAIL, INVERTER_REGISTER_INPUTPV1_SIZE, INVERTER_REGISTER_INPUTPV1_ELEMENTS, INVERTER_REGISTER_INPUTPV1_ACTIVE },                                                                                      // #4
  { INVERTER_REGISTER_INPUTPV2_HEAD, INVERTER_REGISTER_INPUTPV2_TAIL, INVERTER_REGISTER_INPUTPV2_SIZE, INVERTER_REGISTER_INPUTPV2_ELEMENTS, INVERTER_REGISTER_INPUTPV2_ACTIVE },                                                                                      // #5
  { INVERTER_REGISTER_INPUTBAT1_HEAD, INVERTER_REGISTER_INPUTBAT1_TAIL, INVERTER_REGISTER_INPUTBAT1_SIZE, INVERTER_REGISTER_INPUTBAT1_ELEMENTS, INVERTER_REGISTER_INPUTBAT1_ACTIVE },                                                                                 // #6
  { INVERTER_REGISTER_INPUTBAT2_HEAD, INVERTER_REGISTER_INPUTBAT2_TAIL, INVERTER_REGISTER_INPUTBAT1_SIZE, INVERTER_REGISTER_INPUTBAT2_ELEMENTS, INVERTER_REGISTER_INPUTBAT2_ACTIVE },                                                                                 // #7
  { INVERTER_REGISTER_STATISTICS_HEAD, INVERTER_REGISTER_STATISTICS_TAIL, INVERTER_REGISTER_STATISTICS_SIZE, INVERTER_REGISTER_STATISTICS_ELEMENTS, INVERTER_REGISTER_STATISTICS_ACTIVE },                                                                            // #8
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_HEAD, INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_TAIL, INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_SIZE, INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ELEMENTS, INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ACTIVE }  // #9
};

struct inverterRegisterDataStruct {
	uint16_t inverterRegisterAddress;
  char *inverterRegisterDescriptor;
  char *inverterRegisterDataType;
  float inverterRegisterDataFactor;
  char *inverterRegisterUnit;
  bool inverterRegisterActiveMQTT;
};

static struct inverterRegisterDataStruct inverterRegisterSysInfo1SysTime[] = {         // register block SysTime
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_HEAD, "Block_Head", "", 0, "", 0 },             // #0
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_TAIL, "Block_Tail", "", 0, "", 0 },             // #1
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_YEAR, "SysTime_Year", "U16", 1.0, "", 0 },      // #2
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_MONTH, "SysTime_Month", "U16", 1.0, "", 0 },    // #3
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_DAY, "SysTime_Day", "U16", 1.0, "", 0 },        // #4
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_HOUR, "SysTime_Hour", "U16", 1.0, "", 0 },      // #5
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_MINUTE, "SysTime_Minute", "U16", 1.0, "", 0 },  // #6
  { INVERTER_REGISTER_SYSINFO1_SYSTIME_SECOND, "SysTime_Second", "U16", 1.0, "", 0 }   // #7
};

static struct inverterRegisterDataStruct inverterRegisterSysInfo1[] = {                                       // register block #0
  { INVERTER_REGISTER_SYSINFO1_HEAD, "Block_Head", "", 0, "", 0 },                                            // #0
  { INVERTER_REGISTER_SYSINFO1_TAIL, "Block_Tail", "", 0, "", 0 },                                            // #1
  { INVERTER_REGISTER_SYSINFO1_SYSSTATE, "SysState", "U16", 1.0, "", 1 },                                     // #2
  { INVERTER_REGISTER_SYSINFO1_FAULT01, "Fault1", "U16", 1.0, "", 0 },                                        // #3
  { INVERTER_REGISTER_SYSINFO1_FAULT02, "Fault2", "U16", 1.0, "", 0 },                                        // #4
  { INVERTER_REGISTER_SYSINFO1_FAULT03, "Fault3", "U16", 1.0, "", 0 },                                        // #5
  { INVERTER_REGISTER_SYSINFO1_FAULT04, "Fault4", "U16", 1.0, "", 0 },                                        // #6
  { INVERTER_REGISTER_SYSINFO1_FAULT05, "Fault5", "U16", 1.0, "", 0 },                                        // #7
  { INVERTER_REGISTER_SYSINFO1_FAULT06, "Fault6", "U16", 1.0, "", 0 },                                        // #8
  { INVERTER_REGISTER_SYSINFO1_FAULT07, "Fault7", "U16", 1.0, "", 0 },                                        // #9
  { INVERTER_REGISTER_SYSINFO1_FAULT08, "Fault8", "U16", 1.0, "", 0 },                                        // #10
  { INVERTER_REGISTER_SYSINFO1_FAULT09, "Fault9", "U16", 1.0, "", 0 },                                        // #11
  { INVERTER_REGISTER_SYSINFO1_FAULT10, "Fault10", "U16", 1.0, "", 0 },                                       // #12
  { INVERTER_REGISTER_SYSINFO1_FAULT11, "Fault11", "U16", 1.0, "", 0 },                                       // #13
  { INVERTER_REGISTER_SYSINFO1_FAULT12, "Fault12", "U16", 1.0, "", 0 },                                       // #14
  { INVERTER_REGISTER_SYSINFO1_FAULT13, "Fault13", "U16", 1.0, "", 0 },                                       // #15
  { INVERTER_REGISTER_SYSINFO1_FAULT14, "Fault14", "U16", 1.0, "", 0 },                                       // #16
  { INVERTER_REGISTER_SYSINFO1_FAULT15, "Fault15", "U16", 1.0, "", 0 },                                       // #17
  { INVERTER_REGISTER_SYSINFO1_FAULT16, "Fault16", "U16", 1.0, "", 0 },                                       // #18
  { INVERTER_REGISTER_SYSINFO1_FAULT17, "Fault17", "U16", 1.0, "", 0 },                                       // #19
  { INVERTER_REGISTER_SYSINFO1_FAULT18, "Fault18", "U16", 1.0, "", 0 },                                       // #20
  //{ INVERTER_REGISTER_SYSINFO1_COUNTDOWN, "Countdown", "U16", 1.0, "", 0 },                                   // #21
  { INVERTER_REGISTER_SYSINFO1_TEMP_ENV1, "Temperature_Env1", "U16", 1.0, "°C", 1 },                          // #22
  { INVERTER_REGISTER_SYSINFO1_TEMP_HEATSINK1, "Temperature_Heatsink1", "U16", 1.0, "°C", 1 },                // #23
  { INVERTER_REGISTER_SYSINFO1_TEMP_INV1, "Temperature_Inv1", "U16", 1.0, "°C", 1 },                          // #24
  { INVERTER_REGISTER_SYSINFO1_GENERATION_TIME_TODAY, "Generation_Time_Today", "F16", 0.01666667, "h", 1 },   // #25
  { INVERTER_REGISTER_SYSINFO1_GENERATION_TIME_TOTAL, "Generation_Time_Total", "F32",  0.01666667, "h", 1 },  // #26
  { INVERTER_REGISTER_SYSINFO1_SERVICETIME_TOTAL, "ServiceTime_Total", "F32", 0.01666667, "h", 1 }            // #27
};

static struct inverterRegisterDataStruct inverterRegisterSysInfo2[] = {                                               // register block #1
  { INVERTER_REGISTER_SYSINFO2_HEAD, "Block_Head", "", 0, "", 0 },                                                    // #0
  { INVERTER_REGISTER_SYSINFO2_TAIL, "Block_Tail", "", 0, "", 0 },                                                    // #1
  { INVERTER_REGISTER_SYSINFO2_PRODUCTION_CODE, "Production_Code", "U16", 1.0, "", 0 },                               // #2
  { INVERTER_REGISTER_SYSINFO2_HARDWARE_VERSION_0, "Hardware_Version_0", "CHAR", 0, "", 0 },                          // #3
  { INVERTER_REGISTER_SYSINFO2_HARDWARE_VERSION_1, "Hardware_Version_1", "CHAR", 0, "", 0 },                          // #4
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_STAGE_COM, "Software_Version_Stage_COM", "CHAR", 0, "", 0 },          // #5
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MAJOR_COM, "Software_Version_Major_COM", "CHAR", 0, "", 0 },          // #6
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_CUSTOM_COM, "Software_Version_Custom_COM", "CHAR", 0, "", 0 },        // #7
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MINOR_COM, "Software_Version_Minor_COM", "CHAR", 0, "", 0 },          // #8
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_STAGE_MASTER, "Software_Version_Stage_Master", "CHAR", 0, "", 0 },    // #9
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MAJOR_MASTER, "Software_Version_Major_Master", "CHAR", 0, "", 0 },    // #10
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_CUSTOM_MASTER, "Software_Version_Custom_Master", "CHAR", 0, "", 0 },  // #11
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MINOR_MASTER, "Software_Version_Minor_Master", "CHAR", 0, "", 0 },    // #12
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_STAGE_SLAVE, "Software_Version_Stage_Slave", "CHAR", 0, "", 0 },      // #13
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MAJOR_SLAVE, "Software_Version_Major_Slave", "CHAR", 0, "", 0 },      // #14
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_CUSTOM_SLAVE, "Software_Version_Custom_Slave", "CHAR", 0, "", 0 },    // #15
  { INVERTER_REGISTER_SYSINFO2_SOFTWARE_VERSION_MINOR_SLAVE, "Software_Version_Minor_Slave", "CHAR", 0, "", 0 },      // #16
  { INVERTER_REGISTER_SYSINFO2_SAFETY_VERSION_MAJOR, "Safety_Version_Major", "CHAR", 0, "", 0 },                      // #17
  { INVERTER_REGISTER_SYSINFO2_SAFETY_VERSION_MINOR, "Safety_Version_Minor", "CHAR", 0, "", 0 },                      // #18
  { INVERTER_REGISTER_SYSINFO2_BOOT_VERSION_COM, "Boot_Version_COM", "U16", 1.0, "", 0 },                             // #19
  { INVERTER_REGISTER_SYSINFO2_BOOT_VERSION_MASTER, "Boot_Version_Master", "U16", 1.0, "", 0 },                       // #20
  { INVERTER_REGISTER_SYSINFO2_BOOT_VERSION_SLAVE, "Boot_Version_Slave", "U16", 1.0, "", 0 },                         // #21
  { INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_STAGE, "Safety_Firmware_Version_Stage", "CHAR", 0, "", 0 },    // #22
  { INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_MAJOR, "Safety_Firmware_Version_Major", "CHAR", 0, "", 0 },    // #23
  { INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_CUSTOM, "Safety_Firmware_Version_Custom", "CHAR", 0, "", 0 },  // #24
  { INVERTER_REGISTER_SYSINFO2_SAFETY_FIRMWARE_VERSION_MINOR, "Safety_Firmware_Version_Minor", "CHAR", 0, "", 0 },    // #25
  { INVERTER_REGISTER_SYSINFO2_SAFETY_HARDWARE_VERSION0, "Safety_Hardware_Version_0", "CHAR", 0, "", 0 },             // #26
  { INVERTER_REGISTER_SYSINFO2_SAFETY_HARDWARE_VERSION1, "Safety_Hardware_Version_1", "CHAR", 0, "", 0 }              // #27
};

static struct inverterRegisterDataStruct inverterRegisterSysGridOutput1[] = {                                // register block #2
  { INVERTER_REGISTER_GRIDOUTPUT1_HEAD, "Block_Head", "", 0, "", 0 },                                        // #0
  { INVERTER_REGISTER_GRIDOUTPUT1_TAIL, "Block_Tail", "", 0, "", 0 },                                        // #1
  { INVERTER_REGISTER_GRIDOUTPUT1_FREQUENCY_GRID, "Frequency_Grid", "F16", 0.01, "Hz", 1 },                  // #2
  { INVERTER_REGISTER_GRIDOUTPUT1_ACTIVE_POWER, "Active_Power_Output_Total", "F16", 0.01, "kW", 1 },         // #3
  { INVERTER_REGISTER_GRIDOUTPUT1_REACTIVE_POWER, "Reactive_Power_Output_Total", "F16", 0.01, "kvar", 1 },   // #4
  { INVERTER_REGISTER_GRIDOUTPUT1_APPARENT_POWER, "Apparent_Power_Output_Total", "F16", 0.01, "kVA", 1 },    // #5
  { INVERTER_REGISTER_GRIDOUTPUT1_ACTIVE_POWER_PCC, "Active_Power_PCC_Total", "F16", 0.01, "kW", 1 },        // #6
  { INVERTER_REGISTER_GRIDOUTPUT1_REACTIVE_POWER_PCC, "Reactive_Power_PCC_Total", "F16", 0.01, "kvar", 1 },  // #7
  { INVERTER_REGISTER_GRIDOUTPUT1_APPARENT_POWER_PCC, "Apparent_Power_PCC_Total", "F16", 0.01, "kVA", 1 },   // #8
  { INVERTER_REGISTER_GRIDOUTPUT1_POWER_FACTOR, "Power_Factor", "F16", 0.001, "", 1 }                        // #9
};

static struct inverterRegisterDataStruct inverterRegisterEmergencyOutput1[] = {  // register block #3
  { INVERTER_REGISTER_EMERGENCYOUTPUT1_HEAD, "Block_Head", "", 0, "", 0 },       // #0
  { INVERTER_REGISTER_EMERGENCYOUTPUT1_TAIL, "Block_Tail", "CHAR", 0, "", 0 }    // #1
};

static struct inverterRegisterDataStruct inverterRegisterInputPV1[] = {            // register block #4
  { INVERTER_REGISTER_INPUTPV1_HEAD, "Block_Head", "", 0, "", 0 },                 // #0
  { INVERTER_REGISTER_INPUTPV1_TAIL, "Block_Tail", "", 0, "", 0 },                 // #1
  { INVERTER_REGISTER_INPUTPV1_VOLTAGE_PV1, "Voltage_PV1", "F16", 0.1, "V", 1 },   // #2
  { INVERTER_REGISTER_INPUTPV1_CURRENT_PV1, "Current_PV1", "F16", 0.01, "A", 1 },  // #3
  { INVERTER_REGISTER_INPUTPV1_POWER_PV1, "Power_PV1", "F16", 0.01, "kW", 1 },     // #4
  { INVERTER_REGISTER_INPUTPV1_VOLTAGE_PV2, "Voltage_PV2", "F16", 0.1, "V", 1 },   // #5
  { INVERTER_REGISTER_INPUTPV1_CURRENT_PV2, "Current_PV2", "F16", 0.01, "A", 1 },  // #6
  { INVERTER_REGISTER_INPUTPV1_POWER_PV2, "Power_PV2", "F16", 0.01, "kW", 1 }      // #7
};

static struct inverterRegisterDataStruct inverterRegisterInputPV2[] = {                 // register block #5
  { INVERTER_REGISTER_INPUTPV2_HEAD, "Block_Head", "", 0, "", 0 },                      // #0
  { INVERTER_REGISTER_INPUTPV2_TAIL, "Block_Tail", "", 0, "", 0 },                      // #1
  { INVERTER_REGISTER_INPUTPV2_POWER_PV_TOTAL, "Power_PV_Total", "F16", 0.1, "kW", 0 }  // #2
};

static struct inverterRegisterDataStruct inverterRegisterInputBat1[] = {  // register block #6
  { INVERTER_REGISTER_INPUTBAT1_HEAD, "Block_Head", "", 0, "", 0 },       // #0
  { INVERTER_REGISTER_INPUTBAT1_TAIL, "Block_Tail", "CHAR", 0, "", 0 }    // #1
};

static struct inverterRegisterDataStruct inverterRegisterInputBat2[] = {  // register block #7
  { INVERTER_REGISTER_INPUTBAT2_HEAD, "Block_Head", "", 0, "", 0 },       // #0
  { INVERTER_REGISTER_INPUTBAT2_TAIL, "Block_Tail", "CHAR", 0, "", 0 }    // #1
};

static struct inverterRegisterDataStruct inverterRegisterElectricityStatistics1[] = {                        // register block #8
  { INVERTER_REGISTER_STATISTICS_HEAD, "Block_Head", "", 0, "", 0 },                                         // #0
  { INVERTER_REGISTER_STATISTICS_TAIL, "Block_Tail", "", 0, "", 0 },                                         // #1
  { INVERTER_REGISTER_STATISTICS_PV_GENERATION_TODAY, "PV_Generation_Today", "F32", 0.01, "kWh", 1 },        // #2
  { INVERTER_REGISTER_STATISTICS_PV_GENERATION_TOTAL, "PV_Generation_Total", "F32", 0.1, "kWh", 1 },         // #3
  { INVERTER_REGISTER_STATISTICS_LOAD_CONSUMPTION_TODAY, "Load_Consumption_Today", "F32", 0.01, "kWh", 1 },  // #4
  { INVERTER_REGISTER_STATISTICS_LOAD_CONSUMPTION_TOTAL, "Load_Consumption_Total", "F32", 0.1, "kWh", 1 },   // #5
  { INVERTER_REGISTER_STATISTICS_ENERGY_PURCHASE_TODAY, "Energy_Purchase_Today", "F32", 0.01, "kWh", 1 },    // #6
  { INVERTER_REGISTER_STATISTICS_ENERGY_PURCHASE_TOTAL, "Energy_Purchase_Total", "F32", 0.1, "kWh", 1 },     // #7
  { INVERTER_REGISTER_STATISTICS_ENERGY_SELLING_TODAY, "Energy_Selling_Today", "F32", 0.01, "kWh", 1 },      // #8
  { INVERTER_REGISTER_STATISTICS_ENERGY_SELLING_TOTAL, "Energy_Selling_Total", "F32", 0.1, "kWh", 1 }        // #9
  //{ INVERTER_REGISTER_STATISTICS_BAT_CHARGE_TODAY, "Bat_Charge_Today", "F32", 0.01, "kWh", 0 },              // #10
  //{ INVERTER_REGISTER_STATISTICS_BAT_CHARGE_TOTAL, "Bat_Charge_Total", "F32", 0.1, "kWh", 0 },               // #11
  //{ INVERTER_REGISTER_STATISTICS_BAT_DISCHARGE_TODAY, "Bat_Discharge_Today", "F32", 0.01, "kWh", 0 },        // #12
  //{ INVERTER_REGISTER_STATISTICS_BAT_DISCHARGE_TOTAL, "Bat_Discharge_Total", "F32", 0.1, "kWh", 0 }          // #13
};

static struct inverterRegisterDataStruct inverterRegisterUnbalancedSupportControl[] = {                                 // register block #9
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_HEAD, "Block_Head", "", 0, "", 0 },                                     // #0
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_TAIL, "Block_Tail", "", 0, "", 0 },                                     // #1
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_PV_GENERATION_RATIO, "PV_Generation_Ratio", "F16", 0.001, "", 0 },      // #2
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ENERGY_PURCHASE_RATIO, "Energy_Purchase_Ratio", "F16", 0.001, "", 0 },  // #3
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_ENERGY_SELLING_RATIO, "Energy_Selling_Ratio", "F16", 0.001, "", 0 },    // #4
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_BAT_CHARGE_RATIO, "Battery_Charge_Ratio", "F16", 0.001, "", 0 },        // #5
  { INVERTER_REGISTER_UNBALANCEDSUPPORT_CONTROL_BAT_DISCHARGE_RATIO, "Battery_Discharge_Ratio", "F16", 0.001, "", 0 }   // #6
};

struct inverterRegisterStateStruct {
  uint16_t inverterRegisterStateID;
  char *inverterRegisterStateDescriptor;
};

static struct inverterRegisterStateStruct inverterRegisterSysInfo1State[] = {
  { INVERTER_STATE_STANDBY, "Stand By" },
  { INVERTER_STATE_SELF_CHECK, "Self Check" },
  { INVERTER_STATE_NORMAL, "Normal" },
  { INVERTER_STATE_BATTERY_ACTIVATED, "Battery Activated" },
  { INVERTER_STATE_FAULT, "Fault" },
  { INVERTER_STATE_PERMANENT_FAULT, "Permanent Fault" },
  { INVERTER_STATE_OFFLINE, "Offline" }
};

//-------------------------------------------------------------------------------------------------------------------------------------------------------------
void esp32Restart();

void serialOTAReceiver(uint8_t *data, size_t length);

void mqttOutputConverterState();

void outputInfoline();

void mqttKeepAliveReceiver(String &inputTopic, String &inputPayload);

void outputInverterData(uint16_t inverterEntityResponseBufferOffset, char *inverterEntityDesriptor, char *inverterEntityDataType, float inverterEntityDataFactor, char *inverterEntityUnit, bool mqttActive, bool mqttRetained, uint16_t mqttQoS);

bool mqttPublishTopicPayloadCHAR(String mqttTopicID, String mqttTopicEntity, char mqttPayloadCHAR, bool mqttRetained, uint16_t mqttQoS);
bool mqttPublishTopicPayloadUInt16(String mqttTopicID, String mqttTopicEntity, uint16_t mqttPayloadUInt16, bool mqttRetained, uint16_t mqttQoS);
bool mqttPublishTopicPayloadUInt32(String mqttTopicID, String mqttTopicEntity, uint32_t mqttPayloadUInt32, bool mqttRetained, uint16_t mqttQoS);
bool mqttPublishTopicPayloadFloat16(String mqttTopicID, String mqttTopicEntity, float mqttPayloadFloat16, bool mqttRetained, uint16_t mqttQoS);
bool mqttPublishTopicPayloadFloat32(String mqttTopicID, String mqttTopicEntity, float mqttPayloadFloat32, bool mqttRetained, uint16_t mqttQoS);

//EOF